app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "user2"], ["email", "user2@email.com"], ["password", "123"], ["created_at", "2020-04-22 19:36:54.324458"], ["updated_at", "2020-04-22 19:36:54.324458"]]
---
  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "user10"], ["email", "examples10@email.com"], ["updated_at", "2020-04-22 21:22:21.832513"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)